tutorials/precice/volume_coupled/fl1_simple/constant/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

codedSource
{
    type            vectorCodedSource;
    selectionMode   cellSet;
    cellSet         box1;

    fields          (U);
    name            sourceTime;

    codeConstrain //constrain
    #{
        return;
    #};

    codeCorrect //correct
    #{
    	return;
        //const labelList& cells = this->cells();
        //const volVectorField& U_vol = mesh_.lookupObject<volVectorField>("U_vol");
        //for(auto cell : cells)
        //{
        //    fld[cell].x() = U_vol[cell].x();
        //    fld[cell].y() = U_vol[cell].y();
        //    fld[cell].z() = U_vol[cell].z();
        //}
    #};

    codeAddSup // source term
    #{
        return;
    #};

    codeAddSupRho
    #{
        return;
    #};
}
